IdeaRS.OpenModel.Concrete.ColumnDataEc2
Column data Ec2

IdeaRS.OpenModel.Concrete.ColumnDataEc2.#ctor
Constructor

IdeaRS.OpenModel.Concrete.ColumnDataEc2.BracedY
Braced structure Y-Y

IdeaRS.OpenModel.Concrete.ColumnDataEc2.BracedZ
Braced structure Z-Z

IdeaRS.OpenModel.Concrete.ColumnDataEc2.GeometricImperfectionsULS
Use calculation geometric imperfections for ULS

IdeaRS.OpenModel.Concrete.ColumnDataEc2.GeometricImperfectionsSLS
Use calculation geometric imperfections for SLS

IdeaRS.OpenModel.Concrete.ColumnDataEc2.EffectConsidered
Effect considered

IdeaRS.OpenModel.Concrete.ColumnDataEc2.TotalL
Gets or sets the total length of building

IdeaRS.OpenModel.Concrete.ColumnDataEc2.NumberOfVerticalMembersY
Gets or sets the number of vertical member in Y direction.

IdeaRS.OpenModel.Concrete.ColumnDataEc2.NumberOfVerticalMembersZ
Gets or sets the number of vertical member in Z direction.

IdeaRS.OpenModel.Concrete.ColumnDataEc2.Calculation2ndOrderEffect
Use calculation of 2nd order effect

IdeaRS.OpenModel.Concrete.ColumnDataEc2.SecondOrderEffectMethod
Type of calculation method of 2nd order effect

IdeaRS.OpenModel.Concrete.ColumnDataEc2.ValueTypeOfc0Y
Type of c0 value

IdeaRS.OpenModel.Concrete.ColumnDataEc2.UserValuec0Y
c0 user value - for nominal stiffness

IdeaRS.OpenModel.Concrete.ColumnDataEc2.ValueTypeOfc0Z
Type of c0 value

IdeaRS.OpenModel.Concrete.ColumnDataEc2.UserValuec0Z
c0 user value - for nominal stiffness

IdeaRS.OpenModel.Concrete.ColumnDataEc2.ValueTypeOfcY
Type of c value - for nominal curvature

IdeaRS.OpenModel.Concrete.ColumnDataEc2.UserValuecY
c user value - for nominal stiffness

IdeaRS.OpenModel.Concrete.ColumnDataEc2.ValueTypeOfcZ
Type of c value - for nominal curvature

IdeaRS.OpenModel.Concrete.ColumnDataEc2.UserValuecZ
c user value - for nominal stiffness